book_data = {
    "Война и мир": {"author": "Лев Толстой", "year": 1869, "genre": "Роман"},
    "Преступление и наказание": {"author": "Фёдор Достоевский", "year": 1866, "genre": "Роман"},
    "Мастер и Маргарита": {"author": "Михаил Булгаков", "year": 1967, "genre": "Роман"},
    "1984": {"author": "Джордж Оруэлл", "year": 1949, "genre": "Антиутопия"},
    "Гарри Поттер и философский камень": {"author": "Джоан Роулинг", "year": 1997, "genre": "Фэнтези"},
    "Маленький принц": {"author": "Антуан де Сент-Экзюпери", "year": 1943, "genre": "Детская литература"},
    "Три мушкетёра": {"author": "Александр Дюма", "year": 1844, "genre": "Приключения"},
    "Гордость и предубеждение": {"author": "Джейн Остин", "year": 1813, "genre": "Роман"},
    "Властелин колец": {"author": "Джон Толкин", "year": 1954, "genre": "Фэнтези"},
    "Улисс": {"author": "Джеймс Джойс", "year": 1922, "genre": "Классика"}
}

titles = list(book_data.keys())
